#include "stdafx.h"

/********************王道2019年chapter-2.3 ，应用题第20题（P38）********************************
1、题目：
	设头指针为L的带有表头结点的非循环双向链表，其每个结点中除有pred（前驱指针）、data（数据）和next（后继指针）域外，还有一个访问频度域freq。
	在链表被启用前，其值均初始化为零。每当在链表中进行一次Locate（L，x）运算时，令元素值为x的结点中freq域的值增1，
	并使此链表中结点保持按访问频度非增（递减）的顺序排列，同时最近访问的结点排在频度相同的结点的前面，以便使频繁访问的结点总是靠近表头。
	试编写符合上述要求的Locate（L，x）运算的算法，该运算为函数过程，返回找到结点的地址，类型为指针型。
2、算法思想：
	1°：
**********************************************************************************************/
DLinkList1 Locate(DLinkList1 &DL, int e) {





	return DL;
}