#include "stdafx.h"

/********************王道2019年chapter-2.3 ，应用题第5题（P37）********************************
1、题目：
	试编写算法将带头结点的单链表就地逆置，所谓“就地”是指辅助空间复杂度为O(1)
2、算法思想： 
1°：将头结点摘下，然后从第一结点开始，依次前插入到头结点的后面（头插法建立单链表），直到最后一个结点为止，则实现了链表的逆置；
**********************************************************************************************/

void InvertLink(LinkList &L) {
	LNode* p, * r;
	p = L->next;
	L->next = NULL;  //将头节点摘下
	while (p) {
		r = p->next;   //防止断连，用r来暂存p
		p->next = L->next;   //将p节点插入到头节点之后
		L->next = p;  
		p = r;
	}
}